/* =========================================================================
 * File: Test.java$
 *
 * Copyright 2006 by Yuriy Stepovoy.
 * email: stepovoy@gmail.com
 * All rights reserved.
 *
 * =========================================================================
 */

package net.sf.cache4j.test;

/**
 * Test интерфейс для тестов
 *
 * @version $Revision: 1.1 $ $Date: 2010/06/18 17:01:16 $
 * @author Yuriy Stepovoy. <a href="mailto:stepovoy@gmail.com">stepovoy@gmail.com</a>
 **/

public interface Test {
// ----------------------------------------------------------------------------- Константы
// ----------------------------------------------------------------------------- Атрибуты класса
// ----------------------------------------------------------------------------- Статические переменные
// ----------------------------------------------------------------------------- Конструкторы
// ----------------------------------------------------------------------------- Public методы

    /**
     * Вызывается перед началом тестирования
     * @throws java.lang.Exception
     */
    public void init() throws Exception;

    /**
     * Вызывается после выполнения каждого тестового метода
     * @throws java.lang.Exception
     */
    public void afterEachMethod() throws Exception;

    /**
     * Вызывается после тестирования
     * @throws java.lang.Exception
     */
    public void destroy() throws Exception;

// ----------------------------------------------------------------------------- Package scope методы
// ----------------------------------------------------------------------------- Protected методы
// ----------------------------------------------------------------------------- Private методы
// ----------------------------------------------------------------------------- Inner классы
}

/*
$Log: Test.java,v $
Revision 1.1  2010/06/18 17:01:16  smhuang
*** empty log message ***

*/
