/* =========================================================================
 * File: $Id: SoftCacheObject.java,v 1.1 2010/06/18 17:01:10 smhuang Exp $
 *
 * Copyright (c) 2006, Yuriy Stepovoy. All rights reserved.
 * email: stepovoy@gmail.com
 *
 * =========================================================================
 */

package net.sf.cache4j.impl;

import java.lang.ref.SoftReference;

/**
 * Класс SoftCacheObject это магкая :) оболочка для кешируемых объектов.
 * Для хранения ссылки на объект используется класс <code>java.lang.ref.SoftReference</code>
 *
 * @version $Revision: 1.1 $ $Date: 2010/06/18 17:01:10 $
 * @author Yuriy Stepovoy. <a href="mailto:stepovoy@gmail.com">stepovoy@gmail.com</a>
 **/

public class SoftCacheObject extends CacheObject {
// ----------------------------------------------------------------------------- Константы
// ----------------------------------------------------------------------------- Атрибуты класса
// ----------------------------------------------------------------------------- Статические переменные
// ----------------------------------------------------------------------------- Конструкторы

    /**
     * Конструктор
     * @param objId идентификатор кешируемого объекта
     */
    SoftCacheObject(Object objId) {
        super(objId);
    }

// ----------------------------------------------------------------------------- Public методы

    /**
     * Возвращает кешируемый объект
     */
    Object getObject() {
        return _obj==null ? null : ((SoftReference)_obj).get();
    }

    /**
     * Устанавливает кешируемый объект
     */
    void setObject(Object obj) {
        _obj = obj==null ? null : new SoftReference(obj);
    }

// ----------------------------------------------------------------------------- Package scope методы
// ----------------------------------------------------------------------------- Protected методы
// ----------------------------------------------------------------------------- Private методы
// ----------------------------------------------------------------------------- Inner классы
}

/*
$Log: SoftCacheObject.java,v $
Revision 1.1  2010/06/18 17:01:10  smhuang
*** empty log message ***

*/
