/* =========================================================================
 * File: $Id: CacheException.java,v 1.1 2010/06/18 17:01:12 smhuang Exp $CacheException.java,v$
 *
 * Copyright (c) 2006, Yuriy Stepovoy. All rights reserved.
 * email: stepovoy@gmail.com
 *
 * =========================================================================
 */

package net.sf.cache4j;

/**
 * CacheException исключение кидаемое кешем
 *
 * @version $Revision: 1.1 $ $Date: 2010/06/18 17:01:12 $
 * @author Yuriy Stepovoy. <a href="mailto:stepovoy@gmail.com">stepovoy@gmail.com</a>
 **/

public class CacheException extends Exception {
// ----------------------------------------------------------------------------- Константы
// ----------------------------------------------------------------------------- Атрибуты класса
// ----------------------------------------------------------------------------- Статические переменные
// ----------------------------------------------------------------------------- Конструкторы
// ----------------------------------------------------------------------------- Public методы

    /**
     * Конструктор
     */
    public CacheException() {
    }

    /**
     * Конструктор с указанием сообщения
     * @param msg сообщение
     */
    public CacheException(String msg) {
        super(msg);
    }

// ----------------------------------------------------------------------------- Package scope методы
// ----------------------------------------------------------------------------- Protected методы
// ----------------------------------------------------------------------------- Private методы
// ----------------------------------------------------------------------------- Inner классы
}

/*
$Log: CacheException.java,v $
Revision 1.1  2010/06/18 17:01:12  smhuang
*** empty log message ***

*/
