/* =========================================================================
 * File: $Id: Cache.java,v 1.1 2010/06/18 17:01:13 smhuang Exp $Cache.java,v$
 *
 * Copyright (c) 2006, Yuriy Stepovoy. All rights reserved.
 * email: stepovoy@gmail.com
 *
 * =========================================================================
 */

package net.sf.cache4j;

/**
 * Cache интерфейс доступа к объектам кеша
 *
 * @version $Revision: 1.1 $ $Date: 2010/06/18 17:01:13 $
 * @author Yuriy Stepovoy. <a href="mailto:stepovoy@gmail.com">stepovoy@gmail.com</a>
 **/

public interface Cache {
// ----------------------------------------------------------------------------- Константы
// ----------------------------------------------------------------------------- Атрибуты класса
// ----------------------------------------------------------------------------- Статические переменные
// ----------------------------------------------------------------------------- Конструкторы
// ----------------------------------------------------------------------------- Public методы

    /**
     * Помещает объект в кеш.
     * @param objId идентификатор объекта
     * @param obj объект
     * @throws CacheException если возникли проблемы
     */
    public void put(Object objId, Object obj) throws CacheException;

    /**
     * Возвращает объект из кеша.
     * @param objId идентификатор объекта
     * @return Объект возвращается только в том случае, если объект найден
     * и время жизни объекта не закончилось и не превышено время бездействия.
     * @throws CacheException если возникли проблемы
     */
    public Object get(Object objId) throws CacheException;

    /**
     * Удаляет объект из кеша
     * @param objId идентификатор объекта
     * @throws CacheException если возникли проблемы
     */
    public void remove(Object objId) throws CacheException;

    /**
     * Возвращает количество объектов в кеше
     */
    public int size();

    /**
     * Удаляет все объекты из кеша
     * @throws CacheException если возникли проблемы
     */
    public void clear() throws CacheException;

    /**
     * Возвращает конфигруцию кеша
     */
    public CacheConfig getCacheConfig();

    /**
     * Возвращает информацию о кеше
     */
    public CacheInfo getCacheInfo();

// ----------------------------------------------------------------------------- Package scope методы
// ----------------------------------------------------------------------------- Protected методы
// ----------------------------------------------------------------------------- Private методы
// ----------------------------------------------------------------------------- Inner классы
}

/*
$Log: Cache.java,v $
Revision 1.1  2010/06/18 17:01:13  smhuang
*** empty log message ***

*/
