/* =========================================================================
 * File: CacheInfo.java$
 *
 * Copyright (c) 2006, Yuriy Stepovoy. All rights reserved.
 * email: stepovoy@gmail.com
 *
 * =========================================================================
 */

package net.sf.cache4j;

/**
 * Интерфейс CacheInfo предоставляет дополнительную информацию о кеше
 *
 * @version $Revision: 1.1 $ $Date: 2010/06/18 17:01:14 $
 * @author Yuriy Stepovoy. <a href="mailto:stepovoy@gmail.com">stepovoy@gmail.com</a>
 **/

public interface CacheInfo {
// ----------------------------------------------------------------------------- Константы
// ----------------------------------------------------------------------------- Атрибуты класса
// ----------------------------------------------------------------------------- Статические переменные
// ----------------------------------------------------------------------------- Конструкторы
// ----------------------------------------------------------------------------- Public методы

    /**
     * Возвращает количество удачных вызовов метода <code>Cache.get()</code> (метод вернул объект).
     */
    public long getCacheHits();

    /**
     * Возвращает количество неудачных вызовов метода <code>Cache.get()</code> (метод вернул <code>null</code>).
     */
    public long getCacheMisses();

    /**
     * Возвращает количество вызовов метода <code>Cache.put()</code>
     */
    public long getTotalPuts();

    /**
     * Возвращает количество вызовов метода <code>Cache.remove()</code>
     */
    public long getTotalRemoves();

    /**
     * Сбрасывает статистику кеша
     */
    public void reset();

    /**
     * Возвращает объём(в байтах) занимаемый объектами кеша
     */
    public long getMemorySize();

// ----------------------------------------------------------------------------- Package scope методы
// ----------------------------------------------------------------------------- Protected методы
// ----------------------------------------------------------------------------- Private методы
// ----------------------------------------------------------------------------- Inner классы
}

/*
$Log: CacheInfo.java,v $
Revision 1.1  2010/06/18 17:01:14  smhuang
*** empty log message ***

*/
