/* =========================================================================
 * File: $Id: ManagedCache.java,v 1.1 2010/06/18 17:01:14 smhuang Exp $ManagedCache.java,v$
 *
 * Copyright (c) 2006, Yuriy Stepovoy. All rights reserved.
 * email: stepovoy@gmail.com
 *
 * =========================================================================
 */

package net.sf.cache4j;

import net.sf.cache4j.CacheException;
import net.sf.cache4j.CacheConfig;

/**
 * Интерфейс ManagedCache предоставляет методы управления настройками кеша
 *
 * @version $Revision: 1.1 $ $Date: 2010/06/18 17:01:14 $
 * @author Yuriy Stepovoy. <a href="mailto:stepovoy@gmail.com">stepovoy@gmail.com</a>
 **/

public interface ManagedCache {
// ----------------------------------------------------------------------------- Константы
// ----------------------------------------------------------------------------- Атрибуты класса
// ----------------------------------------------------------------------------- Статические переменные
// ----------------------------------------------------------------------------- Конструкторы
// ----------------------------------------------------------------------------- Public методы

    /**
     * Устанавливает конфигурацию кеша.
     * При установке конфигурации все объекты кеша теряются.
     * @param config конфигурация
     * @throws CacheException если возникли проблемы
     */
    public void setCacheConfig(CacheConfig config) throws CacheException;

    /**
     * Выполняет очистку кеша.
     * Удаляются объекты у которых закончилось время жизни или превышено время
     * бездействия.
     * @throws CacheException если возникли проблемы
     */
    public void clean() throws CacheException;

// ----------------------------------------------------------------------------- Package scope методы
// ----------------------------------------------------------------------------- Protected методы
// ----------------------------------------------------------------------------- Private методы
// ----------------------------------------------------------------------------- Inner классы
}

/*
$Log: ManagedCache.java,v $
Revision 1.1  2010/06/18 17:01:14  smhuang
*** empty log message ***

*/
